In [1]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder, LabelEncoder
import numpy as np
from scipy import stats
df =pd.read_csv(r'C:\Users\binoy\OneDrive\Desktop\entri calss\assignment 2\Employee (1).csv')
print (df.head())

   Company   Age  Salary     Place Country  Gender
0      TCS  20.0     NaN   Chennai   India       0
1  Infosys  30.0     NaN    Mumbai   India       0
2      TCS  35.0  2300.0  Calcutta   India       0
3  Infosys  40.0  3000.0     Delhi   India       0
4      TCS  23.0  4000.0    Mumbai   India       0

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  140 non-null    object
 1   Age      130 non-null    float64
 2   Salary   124 non-null    float64
 3   Place    134 non-null    object
 4   Country  148 non-null    object
 5   Gender   148 non-null    int64
dtypes: float64(2), int64(1), object(3)
memory usage: 7.1+ KB

In [3]:
print (df.describe(include = "all"))

       Company         Age       Salary   Place Country      Gender
count      140  130.000000   124.000000     134     148  148.000000
unique       6         NaN          NaN      11       1         NaN
top        TCS         NaN          NaN  Mumbai   India         NaN
freq        53         NaN          NaN      37     148         NaN
mean       NaN   30.484615  5312.467742     NaN     NaN    0.222973
std        NaN   11.096640  2573.764683     NaN     NaN    0.417654
min        NaN    0.000000  1089.000000     NaN     NaN    0.000000
25%        NaN   22.000000  3030.000000     NaN     NaN    0.000000
50%        NaN   32.500000  5000.000000     NaN     NaN    0.000000
75%        NaN   37.750000  8000.000000     NaN     NaN    0.000000
max        NaN   54.000000  9876.000000     NaN     NaN    1.000000

In [4]:
print(f"Unique values in {column}: {df[column].nunique()}")
print(f"Unique values: {df[column].unique()}")
print(df.describe())

NameError: name 'column' is not defined

In [23]:
# data analysis
filtered_df = df[(df['Age'] > 40) & (df['Salary'] < 5000)]
filtered_df

     Company   Age  Salary  Place  Country  Gender
21         2  50.0  3184.0      4        0       0
32         2  45.0  4034.0      1        0       0
39         2  41.0  3000.0      6        0       0
50         2  41.0  3000.0      2        0       0
57         2  51.0  3184.0      5        0       0
68         2  43.0  4034.0      6        0       0
75         2  44.0  3000.0      3        0       0
86         2  41.0  3000.0      4        0       0
93         2  54.0  3184.0      6        0       0
104        2  44.0  4034.0      4        0       0
122        2  44.0  3234.0      6        0       0
129        2  50.0  3184.0      1        0       0
138        0  44.0  3033.0      3        0       0
140        2  44.0  4034.0      5        0       0
145        2  44.0  4034.0      4        0       1

In [8]:
#DATA ENCODING
categorical_cols = df.select_dtypes(include=['object', 'category']).columns
print("Categorical columns:", categorical_cols)

df_one_hot = pd.get_dummies(df, columns=categorical_cols, drop_first=True)
print(df_one_hot.head())

Categorical columns: Index(['Company', 'Place', 'Country'], dtype='object')
    Age  Salary  Gender  Company_Congnizant  Company_Infosys  \
0  20.0     NaN       0               False            False
1  30.0     NaN       0               False             True
2  35.0  2300.0       0               False            False
3  40.0  3000.0       0               False             True
4  23.0  4000.0       0               False            False

   Company_Infosys Pvt Lmt  Company_TCS  Company_Tata Consultancy Services  \
0                    False         True                              False
1                    False        False                              False
2                    False         True                              False
3                    False        False                              False
4                    False         True                              False

   Place_Calcutta  Place_Chennai  Place_Cochin  Place_Delhi  Place_Hyderabad  \
0           False           True         False        False            False
1           False          False         False        False            False
2            True          False         False        False            False
3           False          False         False         True            False
4           False          False         False        False            False

   Place_Mumbai  Place_Nagpur  Place_Noida  Place_Podicherry  Place_Pune
0         False         False        False             False       False
1          True         False        False             False       False
2         False         False        False             False       False
3         False         False        False             False       False
4          True         False        False             False       False

In [9]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
for col in categorical_cols:
    df[col] = label_encoder.fit_transform(df[col])
print(df.head())

   Company   Age  Salary  Place  Country  Gender
0        4  20.0     NaN      2        0       0
1        2  30.0     NaN      6        0       0
2        4  35.0  2300.0      1        0       0
3        2  40.0  3000.0      4        0       0
4        4  23.0  4000.0      6        0       0

In [10]:
# Feature Scaling
from sklearn.preprocessing import StandardScaler, MinMaxScaler
categorical_cols = df.select_dtypes(include=['object', 'category']).columns

# One-Hot Encoding (if appropriate)
df_encoded = pd.get_dummies(df, columns=categorical_cols, drop_first=True)

# Display the transformed DataFrame
print(df_encoded.head())
X = df_encoded 
standard_scaler = StandardScaler()
minmax_scaler = MinMaxScaler()
X_standard_scaled = standard_scaler.fit_transform(X)

X_minmax_scaled = minmax_scaler.fit_transform(X)

# Convert the scaled arrays back to DataFrames for easier inspection
X_standard_scaled_df = pd.DataFrame(X_standard_scaled, columns=X.columns)
X_minmax_scaled_df = pd.DataFrame(X_minmax_scaled, columns=X.columns)

# Display the first few rows of the scaled DataFrames
print("Standard Scaled DataFrame:")
print(X_standard_scaled_df.head())

print("\nMin-Max Scaled DataFrame:")
print(X_minmax_scaled_df.head())

   Company   Age  Salary  Place  Country  Gender
0        4  20.0     NaN      2        0       0
1        2  30.0     NaN      6        0       0
2        4  35.0  2300.0      1        0       0
3        2  40.0  3000.0      4        0       0
4        4  23.0  4000.0      6        0       0
Standard Scaled DataFrame:
    Company       Age    Salary     Place  Country    Gender
0  0.848436 -0.948501       NaN -0.852542      0.0 -0.535683
1 -0.272712 -0.043841       NaN  0.428435      0.0 -0.535683
2  0.848436  0.408489 -1.175200 -1.172787      0.0 -0.535683
3 -0.272712  0.860819 -0.902122 -0.212054      0.0 -0.535683
4  0.848436 -0.677103 -0.512010  0.428435      0.0 -0.535683

Min-Max Scaled DataFrame:
    Company       Age    Salary     Place  Country  Gender
0  0.666667  0.370370       NaN  0.181818      0.0     0.0
1  0.333333  0.555556       NaN  0.545455      0.0     0.0
2  0.666667  0.648148  0.137817  0.090909      0.0     0.0
3  0.333333  0.740741  0.217480  0.363636      0.0     0.0
4  0.666667  0.425926  0.331285  0.545455      0.0     0.0

In [11]:
# data cleaning
missing_values = df.isnull().sum()
print("Missing values in each column:\n", missing_values)

Missing values in each column:
 Company     0
Age        18
Salary     24
Place       0
Country     0
Gender      0
dtype: int64

In [12]:

# Check for missing values
print("Missing values in each column:")
print(df.isnull().sum())

Missing values in each column:
Company     0
Age        18
Salary     24
Place       0
Country     0
Gender      0
dtype: int64

In [18]:

# Remove duplicate rows
df.drop_duplicates(inplace=True)

In [15]:

# Treat null values in numerical columns
numerical_columns = df.select_dtypes(include=['int64', 'float64']).columns
for column in numerical_columns:
    df[column] = df[column].fillna(df[column].mean())

In [16]:
# Treat null values in categorical columns
categorical_columns = df.select_dtypes(include=['object']).columns
for column in categorical_columns:
    df[column] = df[column].fillna(df[column].mode().iloc[0])

In [17]:
# Find outliers in numerical columns
numerical_columns = df.select_dtypes(include=['int64', 'float64']).columns
for column in numerical_columns:
    z_scores = np.abs(stats.zscore(df[column]))
    outliers = df[(z_scores > 3)]
    print(f"Outliers in column {column}:")
    print(outliers)

Outliers in column Company:
Empty DataFrame
Columns: [Company, Age, Salary, Place, Country, Gender]
Index: []
Outliers in column Age:
Empty DataFrame
Columns: [Company, Age, Salary, Place, Country, Gender]
Index: []
Outliers in column Salary:
Empty DataFrame
Columns: [Company, Age, Salary, Place, Country, Gender]
Index: []
Outliers in column Place:
Empty DataFrame
Columns: [Company, Age, Salary, Place, Country, Gender]
Index: []
Outliers in column Country:
Empty DataFrame
Columns: [Company, Age, Salary, Place, Country, Gender]
Index: []
Outliers in column Gender:
Empty DataFrame
Columns: [Company, Age, Salary, Place, Country, Gender]
Index: []

In [5]:
# Verify the cleaned dataset
print("Cleaned dataset:")
print(df.head())

Cleaned dataset:
   Company   Age  Salary     Place Country  Gender
0      TCS  20.0     NaN   Chennai   India       0
1  Infosys  30.0     NaN    Mumbai   India       0
2      TCS  35.0  2300.0  Calcutta   India       0
3  Infosys  40.0  3000.0     Delhi   India       0
4      TCS  23.0  4000.0    Mumbai   India       0